var calendarObject = [
  // فروردین (ماه 1)
 [
  ["۲۵","15","١٤",false,[],true],
  ["۲۶","16","١٥",false,[],true],
  ["۲۷","17","١٦",false,[],true],
  ["۲۸","18","١٧",false,[],true],
  ["۲۹","19","١٨",false,[],true],
  ["۳۰","20","١٩",false,[],true],
  ["۱","21","٢٠",true,["جشن نوروز/جشن سال نو"],false],
  ["۲","22","٢١",true,["عیدنوروز","شهادت حضرت علی علیه السلام"],false],
  ["۳","23","٢٢",true,["عیدنوروز","شب قدر"],false],
  ["۴","24","٢٣",true,["عیدنوروز"],false],
  ["۵","25","٢٤",false,[],false],
  ["۶","26","٢٥",false,[],false],
  ["۷","27","٢٦",false,[],false],
  ["۸","28","٢٧",false,[],false],
  ["۹","29","٢٨",false,[],false],
  ["۱۰","30","٢٩",false,[],false],
  ["۱۱","31","٠١",true,["عید سعید فطر"],false],
  ["۱۲","01","٠٢",true,["روز جمهوری اسلامی","تعطیل به مناسبت عید سعید فطر"],false],
  ["۱۳","02","٠٣",true,["جشن سیزده به در"],false],
  ["۱۴","03","٠٤",false,[],false],
  ["۱۵","04","٠٥",false,[],false],
  ["۱۶","05","٠٦",false,[],false],
  ["۱۷","06","٠٧",false,[],false],
  ["۱۸","07","٠٨",false,["کمیته اخلاق بالینی (۱۲)"],false],
  ["۱۹","08","٠٩",false,["کمیته حفاظت فنی و بهداشت کار (۱۰)","کمیته بهداشت محیط (۱۰)"],false],
  ["۲۰","09","١٠",false,[],false],
  ["۲۱","10","١١",false,["کمیته تغذیه (۱۰)"],false],
  ["۲۲","11","١٢",false,[],false],
  ["۲۳","12","١٣",false,[],false],
  ["۲۴","13","١٤",false,["مدیریت خطر حوادث و بلایا (۷:۳۰)","کنترل عفونت (۱۲:۳۰)"],false],
  ["۲۵","14","١٥",false,[],false],
  ["۲۶","15","١٦",false,["کمیته تجهیزات پزشکی (۱۲)"],false],
  ["۲۷","16","١٧",false,["کمیته طب انتقال خون (۱۲:۳۰)"],false],
  ["۲۸","17","١٨",false,["مدیریت اطلاعات سلامت و فناوری اطلاعات (۱۰)","ارتقاء راهبردی خدمات اورژانس (۱۲)"],false],
  ["۲۹","18","١٩",false,[],false],
  ["۳۰","19","٢٠",false,["کمیته آموزش جامعه (۱۲)"],false],
  ["۳۱","20","٢١",false,["ترویج زایمان طبیعی و ترویج تغذیه با شیر مادر (۷:۳۰)"],false],
  ["۱","21","٢٢",false,[],true],
  ["۲","22","٢٣",false,[],true],
  ["۳","23","٢٤",false,[],true],
  ["۴","24","٢٥",false,[],true],
  ["۵","25","٢٦",false,[],true]
],


  // اردیبهشت (ماه 2)
  [
  ["۳۰","19","٢٠",false,[],true],
  ["۳۱","20","٢١",false,[],true],
  ["۱","21","٢٢",false,["جلسه با دانشگاه آزاد (۸)","کمیته دارودرمان (۱۳)"],false],
  ["۲","22","٢٣",false,["کمیته مرگ و میر، عوارض و آسیب‌شناسی نسوج"],false],
  ["۳","23","٢٤",false,["کمیته مددکاری (کنسل شد)"],false],
  ["۴","24","٢٥",true,["شهادت امام جعفر صادق علیه السلام"],false],
  ["۵","25","٢٦",false,[],false],
  ["۶","26","٢٧",false,[],false],
  ["۷","27","٢٨",false,["جلسه با اعضای هیئت علمی (۸)","جلسه با دیجی پات (۱۰)","کمیته مدیریت اجرایی (۱۱:۳۰)"],false],
  ["۸","28","٢٩",false,[],false],
  ["۹","29","٠١",false,[],false],
  ["۱۰","30","٠٢",false,["کمیته مددکاری (کنسل شد)"],false],
  ["۱۱","01","٠٣",false,[],false],
  ["۱۲","02","٠٤",false,[],false],
  ["۱۳","03","٠٥",false,[],false],
  ["۱۴","04","٠٦",false,[],false],
  ["۱۵","05","٠٧",false,[],false],
  ["۱۶","06","٠٨",false,[],false],
  ["۱۷","07","٠٩",false,["جلسه واحد سنگ‌شکن (۱۰)"],false],
  ["۱۸","08","١٠",false,[],false],
  ["۱۹","09","١١",false,[],false],
  ["۲۰","10","١٢",false,["کمیته مدیریت اجرایی (۷)","جلسه با دیجی‌پات (۱۰:۳۰)","کمیته ارتقاء راهبردی خدمات اورژانس (۱۲)"],false],
  ["۲۱","11","١٣",false,["کمیته سنجش و پایش کیفیت (۱۰)"],false],
  ["۲۲","12","١٤",false,[],false],
  ["۲۳","13","١٥",false,[],false],
  ["۲۴","14","١٦",false,[],false],
  ["۲۵","15","١٧",false,[],false],
  ["۲۶","16","١٨",false,[],false],
  ["۲۷","17","١٩",false,["کمیته مدیریت اجرایی (۷:۳۰)","کمیته RCA (۱۲)"],false],
  ["۲۸","18","٢٠",false,["جلسه MDT (۱۲)","کمیته حفاظت فنی، بهداشت کار و بهداشت محیط (۱۰) (کنسل شد)"],false],
  ["۲۹","19","٢١",false,["کمیته مدیریت خطر حوادث و بلایا (۱۲)"],false],
  ["۳۰","20","٢٢",false,["کمیته طب انتقال خون (۱۲:۳۰)"],false],
  ["۳۱","21","٢٣",false,["ترویج زایمان طبیعی و ترویج تغذیه با شیر مادر (۷:۳۰)","کمیته کنترل عفونت (۱۲:۳۰)"],false],
  ["۱","22","٢٤",false,[],true],
  ["۲","23","٢٥",false,[],true]
],


  // خرداد (ماه 3)
 [
  ["۱","22","٢٤",false,[],false],
  ["۲","23","٢٥",false,[],false],
  ["۳","24","٢٦",false,[],false],
  ["۴","25","٢٧",false,[],false],
  ["۵","26","٢٨",false,[],false],
  ["۶","27","٢٩",false,[],false],
  ["۷","28","٠۱",false,[],false],
  ["۸","29","٠۲",false,["کمیته اخلاق بالینی (۱۱)"],false],
  ["۹","30","٠٣",false,[],false],
  ["۱۰","31","٠٤",false,[],false],
  ["۱۱","01","٠٥",false,["کمیته حفاظت فنی و بهداشت کار","کمیته بهداشت محیط (۱۱)","کمیته اتاق عمل (۱۲:۳۰)"],false],
  ["۱۲","02","٠٦",false,[],false],
  ["۱۳","03","٠٧",false,[],false],
  ["۱۴","04","٠٨",true,["رحلت حضرت امام خمینی"],false],
  ["۱۵","05","٠٩",true,["قیام 15 خرداد"],false],
  ["۱۶","06","١۰",true,["عید سعید قربان"],false],
  ["۱۷","07","١۱",false,[],false],
  ["۱۸","08","١۲",false,[],false],
  ["۱۹","09","١۳",false,[],false],
  ["۲۰","10","١۴",false,[],false],
  ["۲۱","11","١۵",false,["جلسه واحد سنگ‌شکن (۱۰)"],false],
  ["۲۲","12","١۶",false,[],false],
  ["۲۳","13","١۷",false,[],false],
  ["۲۴","14","١۸",true,["عید سعید غدیر خم"],false],
  ["۲۵","15","١۹",false,["جلسه مدیریت بحران (۱۰)"],false],
  ["۲۶","16","٢۰",false,["کمیته تجهیزات پزشکی (تشکیل نشد)","کمیته تغذیه با محوریت مدیریت بحران (۸:۳۰)"],false],
  ["۲۷","17","٢۱",false,[],false],
  ["۲۸","18","٢۲",false,["کمیته مدیریت بحران (۷)","کمیته طب انتقال خون (تشکیل نشد)","جلسه امنیتی (۱۳:۳۰)"],false],
  ["۲۹","19","٢٣",false,["کمیته ارتقاء راهبردی خدمات اورژانس (۱۲)"],false],
  ["۳۰","20","٢٤",false,[],false],
  ["۳۱","21","٢٥",false,["ترویج زایمان طبیعی و ترویج تغذیه با شیر مادر (۷:۳۰)","کنترل عفونت (۱۲:۳۰)"],false]
],
  



  // تیر (ماه 4)
 [
  ["۳۱","21","٢٥",false,[],true],
  ["۱","22","٢٦",false,[],false],
  ["۲","23","٢٧",false,[],false],
  ["۳","24","٢٨",false,["کمیته بخش ویژه ICU (۱۲)"],false],
  ["۴","25","٢٩",false,["جلسه EMR (۱۱)"],false],
  ["۵","26","٣٠",false,["کمیته اخلاق بالینی (۱۲)"],false],
  ["۶","27","٠١",false,[],false],
  ["۷","28","٠٢",false,["جلسه Never Event (۷:۳۰)","کمیته مورتالیتی و موربیدیتی (۷:۳۰ و ۱۳)"],false],
  ["۸","29","٠٣",false,["کمیته ترویج زایمان طبیعی و ترویج تغذیه با شیر مادر (۷:۳۰)"],false],
  ["۹","30","٠٤",false,[],false],
  ["۱۰","01","٠٥",false,[],false],
  ["۱۱","02","٠٦",false,["جلسه EMR (۱۱)"],false],
  ["۱۲","03","٠٧",false,["کمیته اخلاق بالینی (۱۲)"],false],
  ["۱۳","04","٠٨",false,[],false],
  ["۱۴","05","٠٩",true,["تاسوعای حسینی"],false],
  ["۱۵","06","١٠",true,["عاشورای حسینی"],false],
  ["۱۶","07","١١",false,[],false],
  ["۱۷","08","١٢",false,[],false],
  ["۱۸","09","١٣",false,["کمیته مدیریت اطلاعات سلامت و فناوری اطلاعات (۱۰)"],false],
  ["۱۹","10","١٤",false,["جلسه گروه قلب (۷)","کمیته RCA (۱۲)"],false],
  ["۲۰","11","١٥",false,[],false],
  ["۲۱","12","١٦",false,["کمیته دارودرمان (۱۲:۳۰)","کمیته تجهیزات پزشکی (تشکیل نشد)"],false],
  ["۲۲","13","١٧",false,["کمیته آموزش جامعه (۱۲)"],false],
  ["۲۳","14","١٨",false,["کمیته حفاظت فنی و بهداشت کار (۱۰)"],false],
  ["۲۴","15","١٩",false,[],false],
  ["۲۵","16","٢٠",false,["جلسه واحد سنگ‌شکن (۱۰)"],false],
  ["۲۶","17","٢١",false,[],false],
  ["۲۷","18","٢٢",false,[],false],
  ["۲۸","19","٢٣",false,[],false],
  ["۲۹","20","٢٤",false,["ارتقاء راهبردی خدمات بالینی اورژانس (۱۲:۳۰)"],false],
  ["۳۰","21","٢٥",false,["کمیته طب انتقال خون (۱۲:۳۰)"],false],
  ["۳۱","22","٢٦",false,["کمیته کنترل عفونت (۱۲)"],false],
  ["۱","23","٢٧",false,[],true],
  ["۲","24","٢٨",false,[],true],
  ["۳","25","٢٩",false,[],true]
],


  // مرداد (ماه 5)
  [
  ["۲۸","19","٢٣",false,[],true],
  ["۲۹","20","٢٤",false,[],true],
  ["۳۰","21","٢٥",false,[],true],
  ["۳۱","22","٢٦",false,[],true],
  ["۱","23","٢٧",false,[],false],
  ["۲","24","٢٨",false,[],false],
  ["۳","25","٢٩",false,[],false],
  ["۴","26","٠١",false,["کمیته مدیریت اجرایی"],false],
  ["۵","27","٠٢",false,["کمیته دارودرمان (۱۰)"],false],
  ["۶","28","٠٣",false,[],false],
  ["۷","29","٠٤",false,[],false],
  ["۸","30","٠٥",false,[],false],
  ["۹","31","٠٦",false,["جلسه راه‌اندازی طبقه ۴ (۹)"],false],
  ["۱۰","01","٠٧",false,[],false],
  ["۱۱","02","٠٨",false,["کمیته مدیریت اجرایی (۷)"],false],
  ["۱۲","03","٠٩",false,["کمیته تغذیه (۱۲)"],false],
  ["۱۳","04","١٠",false,[],false],
  ["۱۴","05","١١",false,[],false],
  ["۱۵","06","١٢",false,["کمیته RCA (۱۱:۳۰)"],false],
  ["۱۶","07","١٣",false,[],false],
  ["۱۷","08","١٤",false,[],false],
  ["۱۸","09","١٥",false,["کمیته مدیریت اجرایی (۷:۳۰)"],false],
  ["۱۹","10","١٦",false,["کمیته دارودرمان (۱۰)","کمیته تجهیزات پزشکی (۱۳:۳۰)"],false],
  ["۲۰","11","١٧",false,["کمیته بخش ویژه ICU"],false],
  ["۲۱","12","١٨",false,[],false],
  ["۲۲","13","١٩",false,["جلسه سنگ‌شکن (۱۰)"],false],
  ["۲۳","14","٢٠",true,["اربعین حسینی","کمیته حفاظت فنی و بهداشت کار و کمیته بهداشت محیط (کنسل شد)"],false],
  ["۲۴","15","٢١",false,[],false],
  ["۲۵","16","٢٢",false,["کمیته سنجش و پایش کیفیت (کنسل شد)","کمیته اتاق عمل (کنسل شد)"],false],
  ["۲۶","17","٢٣",false,["مدیریت خطر حوادث و بلایا (۱۱)","بیمارستان سبز (۱۱)"],false],
  ["۲۷","18","٢٤",false,["ترویج زایمان طبیعی و ترویج تغذیه با شیر مادر (۷:۳۰)"],false],
  ["۲۸","19","٢٥",false,["کمیته تعالی خدمات بخش اورژانس بیمارستانی (۱۲)"],false],
  ["۲۹","20","٢٦",false,["کمیته طب انتقال خون (۱۲:۳۰)"],false],
  ["۳۰","21","٢٧",false,["کمیته کنترل عفونت (۱۲)"],false],
  ["۳۱","22","٢٨",true,["رحلت رسول اکرم؛شهادت امام حسن مجتبی علیه السلام"],false]
],


  // شهریور (ماه 6)
 [
  ["۱","23","٢٩",false,[],false],
  ["۲","24","٣٠",true,["شهادت امام رضا علیه السلام"],false],
  ["۳","25","٠١",false,[],false],
  ["۴","26","٠٢",false,[],false],
  ["۵","27","٠٣",false,[],false],
  ["۶","28","٠٤",false,[],false],
  ["۷","29","٠٥",false,[],false],
  ["۸","30","٠٦",false,[],false],
  ["۹","31","٠٧",false,["کمیته بخش‌های ویژه ICU (۱۳)"],false],
  ["۱۰","01","٠٨",true,["شهادت امام حسن عسکری علیه السلام"],false],
  ["۱۱","02","٠٩",false,[],false],
  ["۱۲","03","١٠",false,[],false],
  ["۱۳","04","١١",false,[],false],
  ["۱۴","05","١٢",false,[],false],
  ["۱۵","06","١٣",false,["کمیته اتاق عمل (۷) (تشکیل نشد)"],false],
  ["۱۶","07","١٤",false,["کمیته حفاظت فنی و بهداشت کار (۱۱)","کمیته بهداشت محیط (تشکیل نشد)"],false],
  ["۱۷","08","١٥",false,[],false],
  ["۱۸","09","١٦",false,[],false],
  ["۱۹","10","١٧",true,["میلاد رسول اکرم و امام جعفر صادق علیه السلام"],false],
  ["۲۰","11","١٨",false,[],false],
  ["۲۱","12","١٩",false,[],false],
  ["۲۲","13","٢٠",false,["کمیته اخلاق بالینی (تشکیل نشد)"],false],
  ["۲۳","14","٢١",false,["کمیته ترویج زایمان طبیعی و ترویج تغذیه با شیر مادر (۷:۳۰)"],false],
  ["۲۴","15","٢٢",false,["کمیته مدیریت اطلاعات سلامت و فناوری اطلاعات (تشکیل نشد)"],false],
  ["۲۵","16","٢٣",false,[],false],
  ["۲۶","17","٢٤",false,["جلسه سنگ‌شکن (۱۰)"],false],
  ["۲۷","18","٢٥",false,[],false],
  ["۲۸","19","٢٦",false,[],false],
  ["۲۹","20","٢٧",false,["کمیته مدیریت اجرایی (۷:۳۰)","کمیته تعالی خدمات بخش اورژانس بیمارستانی (۱۲)"],false],
  ["۳۰","21","٢٨",false,["کمیته طب انتقال خون (۱۲:۳۰)"],false],
  ["۳۱","22","٢٩",false,["کمیته کنترل عفونت (۱۲)"],false]
],


  // مهر (ماه 7) - با داده‌های واقعی
 [
  ["۲۹","20","٢٧",false,[],true],
  ["۳۰","21","٢٨",false,[],true],
  ["۳۱","22","٢٩",false,[],true],
  ["۱","23","٣٠",false,[],false],
  ["۲","24","٠١",false,[],false],
  ["۳","25","٠٢",false,[],false],
  ["۴","26","٠٣",false,[],false],
  ["۵","27","٠٤",false,[],false],
  ["۶","28","٠٥",false,[],false],
  ["۷","29","٠٦",false,[],false],
  ["۸","30","٠٧",false,[],false],
  ["۹","01","٠٨",false,[],false],
  ["۱۰","02","٠٩",false,[],false],
  ["۱۱","03","١٠",true,["وفات حضرت معصومه سلام الله علیها"],false],
  ["۱۲","04","١١",false,["مدیریت اجرایی (۷:۳۰)"],false],
  ["۱۳","05","١٢",false,[],false],
  ["۱۴","06","١٣",false,["جلسه سهامداران IVF (۱۵)"],false],
  ["۱۵","07","١٤",false,[],false],
  ["۱۶","08","١٥",false,[],false],
  ["۱۷","09","١٦",false,[],false],
  ["۱۸","10","١٧",false,[],false],
  ["۱۹","11","١٨",false,["مدیریت اجرایی (۸)"],false],
  ["۲۰","12","١٩",false,[],false],
  ["۲۱","13","٢٠",false,[],false],
  ["۲۲","14","٢١",false,[],false],
  ["۲۳","15","٢٢",false,["ترویج زایمان طبیعی و ترویج تغذیه با شیر مادر (۷:۳۰–۱۰)"],false],
  ["۲۴","16","٢٣",false,[],false],
  ["۲۵","17","٢٤",false,[],false],
  ["۲۶","18","٢٥",false,[],false],
  ["۲۷","19","٢٦",false,[],false],
  ["۲۸","20","٢٧",false,["تعالی خدمات بخش اورژانس بیمارستانی (۱۲)"],false],
  ["۲۹","21","٢٨",false,["طب انتقال خون (۱۲:۳۰)"],false],
  ["۳۰","22","٢٩",false,["کنترل عفونت (۱۲:۳۰)"],false],
  ["۱","23","٠١",false,[],true],
  ["۲","24","٠٢",false,[],true]
],


[
  ["۲۶","18","٢٥",false,[],true],
  ["۲۷","19","٢٦",false,[],true],
  ["۲۸","20","٢٧",false,[],true],
  ["۲۹","21","٢٨",false,[],true],
  ["۳۰","22","٢٩",false,[],true],
  ["۱","23","٠١",false,[],false],
  ["۲","24","٠٢",false,[],false],
  ["۳","25","٠٣",false,[],false],
  ["۴","26","٠٤",false,[],false],
  ["۵","27","٠٥",false,[],false],
  ["۶","28","٠٦",false,["کمیته بخش‌های ویژه (۱۳:۱۵)"],false],
  ["۷","29","٠٧",false,["جلسه سنگ‌شکن (۱۰)","کمیته مدیریت اطلاعات سلامت و فناوری اطلاعات (۱۱)"],false],
  ["۸","30","٠٨",false,[],false],
  ["۹","31","٠٩",false,[],false],
  ["۱۰","01","١٠",false,["کمیته مددکاری (تشکیل نشد)"],false],
  ["۱۱","02","١١",false,[],false],
  ["۱۲","03","١٢",false,["کمیته دارو و درمان (تشکیل نشد)"],false],
  ["۱۳","04","١٣",false,[],false],
  ["۱۴","05","١٤",false,[],false],
  ["۱۵","06","١٥",false,[],false],
  ["۱۶","07","١٦",false,[],false],
  ["۱۷","08","١٧",false,[],false],
  ["۱۸","09","١٨",false,["کمیته تجهیزات پزشکی (تشکیل نشد)","کمیته حفاظت فنی و بهداشت کار","کمیته بهداشت محیط","بیمارستان سبز (۱۲:۳۰)"],false],
  ["۱۹","10","١٩",false,[],false],
  ["۲۰","11","٢٠",false,["مدیریت خطر، حوادث و بلایا (تشکیل نشد)"],false],
  ["۲۱","12","٢١",false,["کمیته تغذیه (تشکیل نشد)"],false],
  ["۲۲","13","٢٢",false,[],false],
  ["۲۳","14","٢٣",false,[],false],
  ["۲۴","15","٢٤",false,["کمیته اتاق عمل (۸:۳۰)"],false],
  ["۲۵","16","٢٥",false,[],false],
  ["۲۶","17","٢٦",false,["کمیته ارتقاء خدمات بالینی اورژانس (۱۳)"],false],
  ["۲۷","18","٢٧",false,["کمیته کنترل عفونت (۱۲)"],false],
  ["۲۸","19","٢٨",false,["کمیته طب انتقال خون (۱۳)","کمیته مرگ و میر، عوارض و آسیب‌شناسی نسوج (۸:۳۰)"],false],
  ["۲۹","20","٢٩",false,["کمیته اخلاق بالینی (۱۰:۳۰)"],false],
  ["۳۰","21","٣٠",false,[],false]
],


   // آذر (ماه 9) -
  [
    ["۱","22","٠١",false,["کمیته زایمان طبیعی و کمیته ترویج تغذیه با شیر مادر (۷:۳۰)"],false],
    ["۲","23","٠٢",false,[],false],
    ["۳","24","٠٣",true,["شهادت حضرت فاطمه زهرا سلام الله علیها"],false],
    ["۴","25","٠٤",false,["کمیته دارو و درمان (۱۲:۳۰)"],false],
    ["۵","26","٠٥",false,["کمیته اخلاق بالینی (۱۲)"],false],
    ["۶","27","٠٦",false,["کمیته کنترل عفونت (۱۲)"],false],
    ["۷","28","٠٧",false,[],false],
    ["۸","29","٠٨",false,[],false],
    ["۹","30","٠٩",false,[],false],
    ["۱۰","01","١٠",false,["کمیته مددکاری (۱۳)"],false],
    ["۱۱","02","١١",false,[],false],
    ["۱۲","03","١٢",false,["کمیته تغذیه (۱۵:۳۰)"],false],
    ["۱۳","04","١٣",false,[],false],
    ["۱۴","05","١٤",false,[],false],
    ["۱۵","06","١٥",false,[],false],
    ["۱۶","07","١٦",false,["کمیته سنجش و پایش کیفیت (۹) و کمیته مدیریت خطر حوادث و بلایا (۱۲)"],false],
    ["۱۷","08","١٧",false,[],false],
    ["۱۸","09","١٨",false,[],false],
    ["۱۹","10","١٩",false,["کمیته حفاظت فنی و بهداشت کار و کمیته بهداشت محیط (۹)"],false],
    ["۲۰","11","٢٠",false,[],false],
    ["۲۱","12","٢١",false,[],false],
    ["۲۲","13","٢٢",false,[],false],
    ["۲۳","14","٢٣",false,["کمیته تجهیزات پزشکی (۱۰)"],false],
    ["۲۴","15","٢٤",false,[],false],
    ["۲۵","16","٢٥",false,[],false],
    ["۲۶","17","٢٦",false,[],false],
    ["۲۷","18","٢٧",false,[],false],
    ["۲۸","19","٢٨",false,[],false],
    ["۲۹","20","٢٩",false,[],false],
    ["۳۰","21","٣٠",false,["کمیته طب انتقال خون (۱۲)"],false]
  ],


  // دی (ماه 10) - خالی
  
[
  ["۲۹","20","٢٩",false,[],true],
  ["۳۰","21","٣٠",false,[],true],
  ["۱","22","٠١",false,[],false],
  ["۲","23","٠٢",false,[],false],
  ["۳","24","٠٣",false,[],false],
  ["۴","25","٠٤",false,[],false],
  ["۵","26","٠٥",false,[],false],
  ["۶","27","٠٦",false,[],false],
  ["۷","28","٠٧",false,[],false],
  ["۸","29","٠٨",false,[],false],
  ["۹","30","٠٩",false,[],false],
  ["۱۰","31","١٠",false,[],false],
  ["۱۱","01","١١",false,[],false],
  ["۱۲","02","١٢",false,[],false],
  ["۱۳","03","١٣",true,["ولادت امام علی علیه السلام و روز پدر"],false],
  ["۱۴","04","١٤",false,[],false],
  ["۱۵","05","١٥",false,[],false],
  ["۱۶","06","١٦",false,[],false],
  ["۱۷","07","١٧",false,[],false],
  ["۱۸","08","١٨",false,[],false],
  ["۱۹","09","١٩",false,[],false],
  ["۲۰","10","٢٠",false,[],false],
  ["۲۱","11","٢١",false,[],false],
  ["۲۲","12","٢٢",false,[],false],
  ["۲۳","13","٢٣",false,[],false],
  ["۲۴","14","٢٤",false,[],false],
  ["۲۵","15","٢٥",false,[],false],
  ["۲۶","16","٢٦",false,[],false],
  ["۲۷","17","٢٧",true,["مبعث رسول اکرم"],false],
  ["۲۸","18","٢٨",false,[],false],
  ["۲۹","19","٢٩",false,[],false],
  ["۳۰","20","٣٠",false,[],false],
  ["۱","21","٠١",false,[],true],
  ["۲","22","٠٢",false,[],true],
  ["۳","23","٠٣",false,[],true]
],


  // بهمن (ماه 11) - خالی
[
  ["۲۷","17","٢٧",false,[],true],
  ["۲۸","18","٢٨",false,[],true],
  ["۲۹","19","٢٩",false,[],true],
  ["۳۰","20","٣٠",false,[],true],
  ["۱","21","٠١",false,[],false],
  ["۲","22","٠٢",false,[],false],
  ["۳","23","٠٣",true,["ولادت امام حسین علیه السلام و روز پاسدار"],false],
  ["۴","24","٠٤",false,[],false],
  ["۵","25","٠٥",false,[],false],
  ["۶","26","٠٦",false,[],false],
  ["۷","27","٠٧",false,[],false],
  ["۸","28","٠٨",false,[],false],
  ["۹","29","٠٩",false,[],false],
  ["۱۰","30","١٠",false,[],false],
  ["۱۱","31","١١",false,[],false],
  ["۱۲","01","١٢",false,[],false],
  ["۱۳","02","١٣",false,[],false],
  ["۱۴","03","١٤",false,[],false],
  ["۱۵","04","١٥",true,["ولادت حضرت قائم عجل الله تعالی فرجه و جشن نیمه شعبان"],false],
  ["۱۶","05","١٦",false,[],false],
  ["۱۷","06","١٧",false,[],false],
  ["۱۸","07","١٨",false,[],false],
  ["۱۹","08","١٩",false,[],false],
  ["۲۰","09","٢٠",false,[],false],
  ["۲۱","10","٢١",false,[],false],
  ["۲۲","11","٢٢",true,["پیروزی انقلاب اسلامی"],false],
  ["۲۳","12","٢٣",false,[],false],
  ["۲۴","13","٢٤",false,[],false],
  ["۲۵","14","٢٥",false,[],false],
  ["۲۶","15","٢٦",false,[],false],
  ["۲۷","16","٢٧",false,[],false],
  ["۲۸","17","٢٨",false,[],false],
  ["۲۹","18","٢٩",false,[],false],
  ["۳۰","19","٠١",false,[],false],
  ["۱","20","٠٢",false,[],true]
],


  // اسفند (ماه 12) - خالی
  
[
  ["۲۵","14","٢٥",false,[],true],
  ["۲۶","15","٢٦",false,[],true],
  ["۲۷","16","٢٧",false,[],true],
  ["۲۸","17","٢٨",false,[],true],
  ["۲۹","18","٢٩",false,[],true],
  ["۳۰","19","٠١",false,[],true],
  ["۱","20","٠٢",false,[],false],
  ["۲","21","٠٣",false,[],false],
  ["۳","22","٠٤",false,[],false],
  ["۴","23","٠٥",false,[],false],
  ["۵","24","٠٦",false,[],false],
  ["۶","25","٠٧",false,[],false],
  ["۷","26","٠٨",false,[],false],
  ["۸","27","٠٩",false,[],false],
  ["۹","28","١٠",false,[],false],
  ["۱۰","01","١١",false,[],false],
  ["۱۱","02","١٢",false,[],false],
  ["۱۲","03","١٣",false,[],false],
  ["۱۳","04","١٤",false,[],false],
  ["۱۴","05","١٥",false,[],false],
  ["۱۵","06","١٦",false,[],false],
  ["۱۶","07","١٧",false,[],false],
  ["۱۷","08","١٨",false,[],false],
  ["۱۸","09","١٩",false,[],false],
  ["۱۹","10","٢٠",false,[],false],
  ["۲۰","11","٢١",true,["شهادت حضرت علی علیه السلام"],false],
  ["۲۱","12","٢٢",false,[],false],
  ["۲۲","13","٢٣",false,[],false],
  ["۲۳","14","٢٤",false,[],false],
  ["۲۴","15","٢٥",false,[],false],
  ["۲۵","16","٢٦",false,[],false],
  ["۲۶","17","٢٧",false,[],false],
  ["۲۷","18","٢٨",false,[],false],
  ["۲۸","19","٢٩",false,[],false],
  ["۲۹","20","٣٠",true,["روز ملی شدن صنعت نفت ایران"],false]
]
];
const metaYear = {
    year: 1404,
    metaYear: [
        "March - April 2025 | رمضان - شوال - ١٤٤٦",
        "April - May 2025 | شوال - ذوالقعده - ١٤٤٦",
        "May - June 2025 | ذوالقعده - ذوالحجه - ١٤٤٦",
        "June - July 2025 | ذوالحجه - محرم - ١٤٤٦",
        "July - August 2025 | محرم - صفر - ١٤٤٧",
        "August - September 2025 | صفر - ربيع الاول - ١٤٤٧",
        "September - October 2025 | ربيع الاول - ربيع الثاني - ١٤٤٧",
        "October - November 2025 | جمادي الاولي - ١٤٤٧",
        "November - December 2025 | جمادي الثانيه - ١٤٤٧",
        "December 2025 - January 2026 | رجب - ١٤٤٧",
        "January - February 2026 | شعبان - رمضان - ١٤٤٧",
        "February - March 2026 | رمضان - ١٤٤٧",
    ]
}


const cssProperty = {


    "spring": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #5e991a;",
                "color: white;",
            ]
        },


        {
            selector: ".active-season",
            property: [
                "background-color: #5e991a !important;",
                "color:white !important;",
            ]
        },


        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #5e991a !important;"
            ]
        },


        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #5e991a !important;",
            ]
        },


        {
            selector: ".year-meta, .year",
            property: [
                "color: #5e991a;",
            ]
        }
    ],


    "summer": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #4caf50 ;",
                "color: white;",
            ]
        },


        {
            selector: ".active-season",
            property: [
                "background-color: #4caf50  !important;",
                "color:white !important;",
            ]
        },


        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #4caf50  !important;"
            ]
        },


        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #4caf50  !important;",
            ]
        },


        {
            selector: ".year-meta, .year",
            property: [
                "color: #4caf50 ;",
            ]
        }
    ],


    "fall": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #ff9800;",
                "color: white;",
            ]
        },


        {
            selector: ".active-season",
            property: [
                "background-color: #ff9800 !important;",
                "color:white !important;",
            ]
        },


        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #ff9800 !important;"
            ]
        },


        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #ff9800 !important;",
            ]
        },


        {
            selector: ".year-meta, .year",
            property: [
                "color: #ff9800;",
            ]
        }
    ],


    "winter": [
        {
            selector: ".num-dates ul li:hover, .num-dates ul li:hover",
            property: [
                "background-color: #0984e3;",
                "color: white;",
            ]
        },


        {
            selector: ".active-season",
            property: [
                "background-color: #0984e3 !important;",
                "color:white !important;",
            ]
        },


        {
            selector: ".active-season-cr, .month-hover:hover",
            property: [
                "color: #0984e3 !important;"
            ]
        },


        {
            selector: ".holiday:hover, .active-season-bg",
            property: [
                "background-color: #0984e3 !important;",
            ]
        },


        {
            selector: ".year-meta, .year",
            property: [
                "color: #0984e3;",
            ]
        }
    ]
};

